In [22]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

df=pd.DataFrame({"name":["a","b","c","d","a","c"],
                 "hindi":[7,8,9,6,7,8],
                 "english":[9,8,4,7,9,5],
                 "math":[6,7,8,9,6,4]})
df

  name  hindi  english  math
0    a      7        9     6
1    b      8        8     7
2    c      9        4     8
3    d      6        7     9
4    a      7        9     6
5    c      8        5     4

In [25]:
df.drop_duplicates(inplace=True)
df

  name  hindi  english  math
0    a      7        9     6
1    b      8        8     7
2    c      9        4     8
3    d      6        7     9
5    c      8        5     4

In [27]:
df1=pd.read_csv("loan_data.csv")
df1.head(3)

,race,gender,date,zip,income,type,term,interest,principal,approved,adj_bls_2,id
0,hispanic/latino,male,2016-01-01,60623.0,72230.0,home,180,3.389672,508761,False,0.34,AP20161-0-2
1,other,male,2013-03-01,60625.0,18543.0,home,360,0.277318,119738,False,0.14,AP20133-1-23
2,other,male,2011-11-01,60623.0,30228.0,home,240,4.398939,265779,False,0.08,AP201111-2-22

In [28]:
df1.shape

(1307, 12)

In [29]:
df1.drop_duplicates(inplace=True)

In [30]:
df1.shape

(1297, 12)